{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.6.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 80, 80], "dtype": "float32", "sparse": false, "ragged": false, "name": "input.1"}, "name": "input.1", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "524_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "524_pad", "inbound_nodes": [[["input.1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "524", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "524", "inbound_nodes": [[["524_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "338", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "338", "inbound_nodes": [[["524", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "527_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "527_pad", "inbound_nodes": [[["338", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "527", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "527", "inbound_nodes": [[["527_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "342", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "342", "inbound_nodes": [[["527", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "530", "trainable": true, "dtype": "float32", "filters": 103, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "530", "inbound_nodes": [[["342", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "346", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "346", "inbound_nodes": [[["530", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "533_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "533_pad", "inbound_nodes": [[["346", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "533", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "533", "inbound_nodes": [[["533_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "350", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "350", "inbound_nodes": [[["533", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "536", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "536", "inbound_nodes": [[["350", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "539", "trainable": true, "dtype": "float32", "filters": 13, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "539", "inbound_nodes": [[["536", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "356", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "356", "inbound_nodes": [[["539", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "542_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "542_pad", "inbound_nodes": [[["356", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "542", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "542", "inbound_nodes": [[["542_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "360", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "360", "inbound_nodes": [[["542", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "545", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "545", "inbound_nodes": [[["360", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "363", "trainable": true, "dtype": "float32"}, "name": "363", "inbound_nodes": [[["536", 0, 0, {}], ["545", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "548", "trainable": true, "dtype": "float32", "filters": 13, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "548", "inbound_nodes": [[["363", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "367", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "367", "inbound_nodes": [[["548", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "551_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "551_pad", "inbound_nodes": [[["367", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "551", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "551", "inbound_nodes": [[["551_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "371", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "371", "inbound_nodes": [[["551", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "554", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "554", "inbound_nodes": [[["371", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "374", "trainable": true, "dtype": "float32"}, "name": "374", "inbound_nodes": [[["363", 0, 0, {}], ["554", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "557", "trainable": true, "dtype": "float32", "filters": 13, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "557", "inbound_nodes": [[["374", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "378", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "378", "inbound_nodes": [[["557", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "560_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "560_pad", "inbound_nodes": [[["378", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "560", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "560", "inbound_nodes": [[["560_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "382", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "382", "inbound_nodes": [[["560", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "563", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "563", "inbound_nodes": [[["382", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "385", "trainable": true, "dtype": "float32"}, "name": "385", "inbound_nodes": [[["374", 0, 0, {}], ["563", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "566", "trainable": true, "dtype": "float32", "filters": 13, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "566", "inbound_nodes": [[["385", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "389", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "389", "inbound_nodes": [[["566", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "569_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "569_pad", "inbound_nodes": [[["389", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "569", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "569", "inbound_nodes": [[["569_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "393", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "393", "inbound_nodes": [[["569", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "572", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "572", "inbound_nodes": [[["393", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "396", "trainable": true, "dtype": "float32"}, "name": "396", "inbound_nodes": [[["385", 0, 0, {}], ["572", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "575", "trainable": true, "dtype": "float32", "filters": 231, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "575", "inbound_nodes": [[["396", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "400", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "400", "inbound_nodes": [[["575", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "578_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "578_pad", "inbound_nodes": [[["400", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "578", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "578", "inbound_nodes": [[["578_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "404", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "404", "inbound_nodes": [[["578", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "581", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "581", "inbound_nodes": [[["404", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "584", "trainable": true, "dtype": "float32", "filters": 231, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "584", "inbound_nodes": [[["581", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "410", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "410", "inbound_nodes": [[["584", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "587_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "587_pad", "inbound_nodes": [[["410", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "587", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "587", "inbound_nodes": [[["587_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "414", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "414", "inbound_nodes": [[["587", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "590", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "590", "inbound_nodes": [[["414", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "417", "trainable": true, "dtype": "float32"}, "name": "417", "inbound_nodes": [[["581", 0, 0, {}], ["590", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "593", "trainable": true, "dtype": "float32", "filters": 52, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "593", "inbound_nodes": [[["417", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "421", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "421", "inbound_nodes": [[["593", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "596_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "596_pad", "inbound_nodes": [[["421", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "596", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "596", "inbound_nodes": [[["596_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "425", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "425", "inbound_nodes": [[["596", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "599", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "599", "inbound_nodes": [[["425", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "428", "trainable": true, "dtype": "float32"}, "name": "428", "inbound_nodes": [[["417", 0, 0, {}], ["599", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "602", "trainable": true, "dtype": "float32", "filters": 26, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "602", "inbound_nodes": [[["428", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "432", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "432", "inbound_nodes": [[["602", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "605_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "605_pad", "inbound_nodes": [[["432", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "605", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "605", "inbound_nodes": [[["605_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "436", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "436", "inbound_nodes": [[["605", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "608", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "608", "inbound_nodes": [[["436", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "439", "trainable": true, "dtype": "float32"}, "name": "439", "inbound_nodes": [[["428", 0, 0, {}], ["608", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "611", "trainable": true, "dtype": "float32", "filters": 77, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "611", "inbound_nodes": [[["439", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "443", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "443", "inbound_nodes": [[["611", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "614_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "614_pad", "inbound_nodes": [[["443", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "614", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "614", "inbound_nodes": [[["614_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "447", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "447", "inbound_nodes": [[["614", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "617", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "617", "inbound_nodes": [[["447", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "450", "trainable": true, "dtype": "float32"}, "name": "450", "inbound_nodes": [[["439", 0, 0, {}], ["617", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "620", "trainable": true, "dtype": "float32", "filters": 26, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "620", "inbound_nodes": [[["450", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "454", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "454", "inbound_nodes": [[["620", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "623_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "623_pad", "inbound_nodes": [[["454", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "623", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "623", "inbound_nodes": [[["623_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "458", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "458", "inbound_nodes": [[["623", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "626", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "626", "inbound_nodes": [[["458", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "461", "trainable": true, "dtype": "float32"}, "name": "461", "inbound_nodes": [[["450", 0, 0, {}], ["626", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "629", "trainable": true, "dtype": "float32", "filters": 26, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "629", "inbound_nodes": [[["461", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "465", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "465", "inbound_nodes": [[["629", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "632_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "632_pad", "inbound_nodes": [[["465", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "632", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "632", "inbound_nodes": [[["632_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "469", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "469", "inbound_nodes": [[["632", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "635", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "635", "inbound_nodes": [[["469", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "472", "trainable": true, "dtype": "float32"}, "name": "472", "inbound_nodes": [[["461", 0, 0, {}], ["635", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "638", "trainable": true, "dtype": "float32", "filters": 308, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "638", "inbound_nodes": [[["472", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "476", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "476", "inbound_nodes": [[["638", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "641_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "641_pad", "inbound_nodes": [[["476", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "641", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "641", "inbound_nodes": [[["641_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "480", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "480", "inbound_nodes": [[["641", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "644", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "644", "inbound_nodes": [[["480", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "647", "trainable": true, "dtype": "float32", "filters": 26, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "647", "inbound_nodes": [[["644", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "486", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "486", "inbound_nodes": [[["647", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "650_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "650_pad", "inbound_nodes": [[["486", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "650", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "650", "inbound_nodes": [[["650_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "490", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "490", "inbound_nodes": [[["650", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "653", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "653", "inbound_nodes": [[["490", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "493", "trainable": true, "dtype": "float32"}, "name": "493", "inbound_nodes": [[["644", 0, 0, {}], ["653", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "656", "trainable": true, "dtype": "float32", "filters": 26, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "656", "inbound_nodes": [[["493", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "497", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "497", "inbound_nodes": [[["656", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "659_pad", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_first"}, "name": "659_pad", "inbound_nodes": [[["497", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "659", "trainable": true, "dtype": "float32", "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "659", "inbound_nodes": [[["659_pad", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "501", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "501", "inbound_nodes": [[["659", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "662", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "662", "inbound_nodes": [[["501", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "504", "trainable": true, "dtype": "float32"}, "name": "504", "inbound_nodes": [[["493", 0, 0, {}], ["662", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "665", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [1, 1], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "665", "inbound_nodes": [[["504", 0, 0, {}]]]}, {"class_name": "PReLU", "config": {"name": "508", "trainable": true, "dtype": "float32", "alpha_initializer": {"class_name": "Zeros", "config": {}}, "alpha_regularizer": null, "alpha_constraint": null, "shared_axes": [2, 3]}, "name": "508", "inbound_nodes": [[["665", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "668", "trainable": true, "dtype": "float32", "kernel_size": [5, 5], "strides": [1, 1], "padding": "valid", "data_format": "channels_first", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "activity_regularizer": null, "bias_constraint": null, "depth_multiplier": 1, "depthwise_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "depthwise_regularizer": null, "depthwise_constraint": null}, "name": "668", "inbound_nodes": [[["508", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "518", "trainable": true, "dtype": "float32", "data_format": "channels_first"}, "name": "518", "inbound_nodes": [[["668", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "520", "trainable": true, "dtype": "float32", "units": 128, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "520", "inbound_nodes": [[["518", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "521", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.8999999761581421, "epsilon": 9.999999747378752e-06, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "521", "inbound_nodes": [[["520", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "523", "trainable": true, "dtype": "float32", "units": 3, "activation": "linear", "use_bias": false, "kernel_initializer": {"class_name": "Zeros", "config": {}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "523", "inbound_nodes": [[["521", 0, 0, {}]]]}], "input_layers": [["input.1", 0, 0]], "output_layers": [["523", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "338/alpha", "shape": [32, 1, 1], "dtype": "float32"}, {"name": "342/alpha", "shape": [32, 1, 1], "dtype": "float32"}, {"name": "346/alpha", "shape": [103, 1, 1], "dtype": "float32"}, {"name": "350/alpha", "shape": [103, 1, 1], "dtype": "float32"}, {"name": "356/alpha", "shape": [13, 1, 1], "dtype": "float32"}, {"name": "360/alpha", "shape": [13, 1, 1], "dtype": "float32"}, {"name": "367/alpha", "shape": [13, 1, 1], "dtype": "float32"}, {"name": "371/alpha", "shape": [13, 1, 1], "dtype": "float32"}, {"name": "378/alpha", "shape": [13, 1, 1], "dtype": "float32"}, {"name": "382/alpha", "shape": [13, 1, 1], "dtype": "float32"}, {"name": "389/alpha", "shape": [13, 1, 1], "dtype": "float32"}, {"name": "393/alpha", "shape": [13, 1, 1], "dtype": "float32"}, {"name": "400/alpha", "shape": [231, 1, 1], "dtype": "float32"}, {"name": "404/alpha", "shape": [231, 1, 1], "dtype": "float32"}, {"name": "410/alpha", "shape": [231, 1, 1], "dtype": "float32"}, {"name": "414/alpha", "shape": [231, 1, 1], "dtype": "float32"}, {"name": "421/alpha", "shape": [52, 1, 1], "dtype": "float32"}, {"name": "425/alpha", "shape": [52, 1, 1], "dtype": "float32"}, {"name": "432/alpha", "shape": [26, 1, 1], "dtype": "float32"}, {"name": "436/alpha", "shape": [26, 1, 1], "dtype": "float32"}, {"name": "443/alpha", "shape": [77, 1, 1], "dtype": "float32"}, {"name": "447/alpha", "shape": [77, 1, 1], "dtype": "float32"}, {"name": "454/alpha", "shape": [26, 1, 1], "dtype": "float32"}, {"name": "458/alpha", "shape": [26, 1, 1], "dtype": "float32"}, {"name": "465/alpha", "shape": [26, 1, 1], "dtype": "float32"}, {"name": "469/alpha", "shape": [26, 1, 1], "dtype": "float32"}, {"name": "476/alpha", "shape": [308, 1, 1], "dtype": "float32"}, {"name": "480/alpha", "shape": [308, 1, 1], "dtype": "float32"}, {"name": "486/alpha", "shape": [26, 1, 1], "dtype": "float32"}, {"name": "490/alpha", "shape": [26, 1, 1], "dtype": "float32"}, {"name": "497/alpha", "shape": [26, 1, 1], "dtype": "float32"}, {"name": "501/alpha", "shape": [26, 1, 1], "dtype": "float32"}, {"name": "508/alpha", "shape": [512, 1, 1], "dtype": "float32"}, {"name": "520/kernel", "shape": [512, 128], "dtype": "float32"}, {"name": "521/gamma", "shape": [128], "dtype": "float32"}, {"name": "521/beta", "shape": [128], "dtype": "float32"}, {"name": "521/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "521/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "523/kernel", "shape": [128, 3], "dtype": "float32"}, {"name": "524/kernel", "shape": [3, 3, 3, 32], "dtype": "float32"}, {"name": "524/bias", "shape": [32], "dtype": "float32"}, {"name": "527/depthwise_kernel", "shape": [3, 3, 32, 1], 